<!DOCTYPE html>
<html>
    <head>
        <meta charset="utf-8">
        <title>P&aacute;gina de pr&aacute;ctica 5</title>
        <meta name="viewport" content="width=device-width, initial-scale=1.0">
        <link rel="shortcut icon" href="escudo.jpg">
    </head>
    <body>
        <hgroup>
            <h1>Oussama Ed Dahabi Lakhal</h1>
            <h3>Mi p&aacute;gina con enlaces</h3>
        </hgroup>
        <pre>
            <p>Qu&eacute; es una p&aacute;gina local? Indica un ejemplo.</p>
            <p>
            Los enlaces locales tienen la misma sintaxis que los enlaces externos, lo unico que cambia es el valor del atributo href
            que en lugar de indicarnos una URL o direcci&oacute;n web, debe indicarnos la ruta o camino que debemos seguir para encontrar
            ese archivo. Dicho con otras plabras, una URL local nos lleva a otra página o archivo del mismo sitio de Internet.
            </p>
            <br/>
            <p>¿Qu&eacute; es una p&aacute;gina remota? Indica un ejemplo</p>
            <p>
            Las p&aacute;ginas remotas tambi&eacute;n llamadas enlaces remotos, son los enlaces que se dirigen hacia p&aacute;ginas
            que se encuentran fuera de nuestro sitio web, es decir, cualquier otra p&aacute;gina que no forma parte de nuestro sitio.
            </p>
            <br/>
            <p>¿Qué se indica en HREF?</p>
            <p>
            Para poder indicar el destino de un enlace utilizamos el atributo href. En valor del atributo href puede ser cualquier url
            que represente un recurso. Es decir, una p&aacute;gina, una parte de una p&aacute;gina, una URL gen&eacute;rica, un
            archivo,etc.
            </p>
            <br/>
            <p>¿Qu&eacute; ocurre si no se cierra la etiqueta A?</p>
            <p>
            Esto podr&iacute;a repercutir en el funcionamiento de nuestro enlace porque al pulsar sobre el enlace puede que este no
            nos rediriga al lugar donde le hemos indicado(o directamente no nos rediriga a ningun lado).
            </p>
            <br/>
            <p>Haz click <a href="https://www.google.es/" style="color: blue;" target="_blank">aqu&iacute;</a> para ir a Google</p>
            <br/>
            <p>Haz click <a href="file:///C:/Users/oussama/Downloads/docPDF.pdf" style="color: blue;" target="_blank">aqu&iacute;</a> para acceder al archivo PDF</p>
            <br/>
            <p>Haz click <a href="https://www.granada.org/" style="color: red;" target="_blank">aqu&iacute;</a> para acceder a la p&aacute;gina web de ayuntamiento de Granada</p>
            <br/>
            <p>Accede a la p&aacute;gina del Granada CF pulsando en la imagen</p>
            <a href="https://www.granadacf.es/" target="_blank"><img src="escudo.jpg" alt="Escudo del Granada CF" width="300px"; height="300px"/></a>
            <br/>
            <p>Haz click <a href="C:\Users\oussama\Downloads\HTML.html\paginaLocal.html" style="color: blue;" target="_blank">aqu&iacute;</a> para acceder a mi p&aacute;gina en la cual empleo un enlace local</p>
            <br/>
            <p>Haz click <a href="https://www.fcbarcelona.com/en/" style="color: blue;" target="_blank">aqu&iacute;</a> para acceder a la p&aacute;gina web del FC Barcelona en la cual utilizo un enlace externo para acceder a ella</p>
            <br/>
            <p>Haz click <a href="C:\Users\oussama\Pictures\Oussama.html" target="_blank" style="color: blue;">aqu&iacute</a> para ver mi estrucura de carpetas</p>
        </pre>
    </body>
</html>